Repository: tillt/PlayEm
Catalog: PlayEmCore/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, uk

# activity.beat_detection.detecting
source: detecting beats
ar: جارٍ كشف الإيقاع
de: erkenne beats
es: detectando ritmos
fr: détection du rythme
ja: ビートを検出中
uk: виявлення ритму

# activity.beat_detection.done
source: beats tracked
ar: اكتمل كشف الإيقاع
de: beats erkannt
es: detección de ritmo completada
fr: détection du rythme terminée
ja: ビート検出が完了しました
uk: виявлення ритму завершено

# activity.beat_detection.initializing
source: initializing beat detection
ar: جارٍ تهيئة كشف الإيقاع
de: initialisiere beat erkennung
es: inicializando detección de ritmo
fr: initialisation de la détection du rythme
ja: ビート検出を初期化中
uk: ініціалізація виявлення ритму

# activity.beat_detection.refining
source: refining beats
ar: جارٍ تحسين الإيقاع
de: ueberarbeite beats
es: refinando ritmos
fr: affinage du rythme
ja: ビートを精査中
uk: уточнення ритму

# activity.beat_detection.title
source: Beat Detection
ar: كشف الإيقاع
de: Beat Erkennung
es: Detectando ritmos
fr: Détection du rythme
ja: ビートを検出中
uk: Виявлення ритму

# activity.decode.decoding_data
source: decoding compressed audio data
ar: جارٍ فك ترميز بيانات الصوت
de: dekodiere komprimierte audio daten
es: decodificando datos de audio
fr: décodage des données audio
ja: オーディオデータをデコード中
uk: декодування аудіоданих

# activity.decode.done
source: decoding audio done
ar: اكتمل فك الترميز
de: fertig mit dem dekodieren
es: decodificación completada
fr: décodage terminé
ja: デコードが完了しました
uk: декодування завершено

# activity.decode.initializing_engine
source: initializing engine
ar: جارٍ تهيئة محرك فك الترميز
de: initialisiere komponente
es: inicializando motor de decodificación
fr: initialisation du moteur de décodage
ja: デコードエンジンを初期化中
uk: ініціалізація рушія декодування

# activity.decode.title
source: Decoding Sample
ar: فك ترميز الصوت
de: Dekodiere Sample
es: Decodificando audio
fr: Décodage audio
ja: オーディオをデコード中
uk: Декодування аудіо

# activity.key_detection.detecting
source: detecting key
ar: جارٍ كشف المقام
de: erkenne tonart
es: detectando tonalidad
fr: détection de la tonalité
ja: キーを検出中
uk: виявлення тональності

# activity.key_detection.title
source: Detecting Key
ar: كشف المقام
de: Erkenne Tonart
es: Detectando tonalidad
fr: Détection de la tonalité
ja: キーを検出中
uk: Виявлення тональності

# activity.tracklist_detection.aborted
source: aborted
ar: تم إيقاف اكتشاف قائمة المسارات
de: abgebrochen
es: detección de lista de pistas cancelada
fr: détection de la liste de pistes annulée
ja: トラックリスト検出が中断されました
uk: виявлення треклиста скасовано

# activity.tracklist_detection.baseline_done
source: baseline done
ar: اكتمل الكشف الأساسي
de: fertig mit der grunderkennung
es: detección base completada
fr: détection de base terminée
ja: ベースライン検出が完了しました
uk: базове виявлення завершено

# activity.tracklist_detection.maybe_format
source: Maybe: %@
ar: تطابق المسار: %@
de: Vielleicht: %@
es: coincidencia de pista: %@
fr: correspondance de piste : %@
ja: トラック候補: %@
uk: збіг треку: %@

# activity.tracklist_detection.refinement_done
source: refinement done
ar: اكتمل تحسين قائمة المسارات
de: fertig mit der ueberarbeitung
es: refinamiento de lista de pistas completado
fr: affinage de la liste de pistes terminé
ja: トラックリストの精査が完了しました
uk: уточнення треклиста завершено

# activity.tracklist_detection.refining
source: refining tracklist
ar: جارٍ تحسين قائمة المسارات
de: ueberarbeite track liste
es: refinando lista de pistas
fr: affinage de la liste de pistes
ja: トラックリストを精査中
uk: уточнення треклиста

# activity.tracklist_detection.title
source: Tracklist Detection
ar: اكتشاف قائمة المسارات
de: Tracklist Erkennung
es: Detectando lista de pistas
fr: Détection de la liste de pistes
ja: トラックリストを検出中
uk: Виявлення треклиста

# common.unknown
source: unknown
ar: غير معروف
de: unbekannt
es: desconocido
fr: inconnu
ja: 不明
uk: невідомо

# error.missing_location_identify
source: Cannot identify item as it lacks a location
ar: لا يمكن التعرف على العنصر لأنه بلا موقع
de: Den Eintrag kann ich nicht validieren - hat ja gar keinen Ort
es: No se puede identificar el elemento porque no tiene ubicación
fr: Impossible d’identifier l’élément car il n’a pas d’emplacement
ja: 場所がないため項目を識別できません
uk: Неможливо визначити елемент, оскільки немає розташування

# error.missing_location_sync
source: Cannot sync item back as it lacks a location
ar: لا يمكن مزامنة العنصر لأنه بلا موقع
de: Den Eintrag kann ich nicht zurück schreiben - hat ja gar keinen Ort
es: No se puede sincronizar el elemento porque no tiene ubicación
fr: Impossible de synchroniser l’élément car il n’a pas d’emplacement
ja: 場所がないため項目を同期できません
uk: Неможливо синхронізувати елемент, оскільки немає розташування

# error.unknown_file_type_format
source: Unknown file type (%@)
ar: نوع ملف غير معروف (%@)
de: Unbekannter Datei Typ (%@)
es: Tipo de archivo desconocido (%@)
fr: Type de fichier inconnu (%@)
ja: 不明なファイル形式（%@）
uk: Невідомий тип файлу (%@)

# media.channels.stereo
source: stereo
ar: ستيريو
es: estéreo
fr: stéréo
ja: ステレオ
uk: стерео
